In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("D:\pandas\emp.csv")
df=pd.DataFrame(data)
df

   empid       ename    sal         doj
0   1001   mallinath  50000  10/10/2022
1   1002     sathish  60000   10/8/2022
2   1003  jeethendra  70000  10/11/2022
3   1004     krishna  80000  10/12/2022
4   1005      ashwin  80000  10/13/2022
5   1006      ganesh  95000   10/8/2022

In [7]:
df.head()

   empid       ename    sal         doj
0   1001   mallinath  50000  10/10/2022
1   1002     sathish  60000   10/8/2022
2   1003  jeethendra  70000  10/11/2022
3   1004     krishna  80000  10/12/2022
4   1005      ashwin  80000  10/13/2022

In [8]:
df['empid']

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
Name: empid, dtype: int64

In [9]:
import pyspark

ModuleNotFoundError: No module named 'pyspark'

In [10]:
import os 
import sys
import findspark
findspark.init()
os.environ["JAVA_HOME"]='C:\bigdata\Java'
os.environ["SPARK_HOME"]='C:\bigdata\spark-3.1.2-bin-hadoop3.2'
from pyspark.sql import *
from pyspark.sql.functios import *

ModuleNotFoundError: No module named 'findspark'

In [11]:
df

   empid       ename    sal         doj
0   1001   mallinath  50000  10/10/2022
1   1002     sathish  60000   10/8/2022
2   1003  jeethendra  70000  10/11/2022
3   1004     krishna  80000  10/12/2022
4   1005      ashwin  80000  10/13/2022
5   1006      ganesh  95000   10/8/2022

In [12]:
df.head(2)

   empid      ename    sal         doj
0   1001  mallinath  50000  10/10/2022
1   1002    sathish  60000   10/8/2022

In [16]:
df.shape

(6, 4)

In [17]:
df

   empid       ename    sal         doj
0   1001   mallinath  50000  10/10/2022
1   1002     sathish  60000   10/8/2022
2   1003  jeethendra  70000  10/11/2022
3   1004     krishna  80000  10/12/2022
4   1005      ashwin  80000  10/13/2022
5   1006      ganesh  95000   10/8/2022

In [18]:
df.head()

   empid       ename    sal         doj
0   1001   mallinath  50000  10/10/2022
1   1002     sathish  60000   10/8/2022
2   1003  jeethendra  70000  10/11/2022
3   1004     krishna  80000  10/12/2022
4   1005      ashwin  80000  10/13/2022

In [19]:
df.tail()

   empid       ename    sal         doj
1   1002     sathish  60000   10/8/2022
2   1003  jeethendra  70000  10/11/2022
3   1004     krishna  80000  10/12/2022
4   1005      ashwin  80000  10/13/2022
5   1006      ganesh  95000   10/8/2022

In [20]:
df.head(2)

   empid      ename    sal         doj
0   1001  mallinath  50000  10/10/2022
1   1002    sathish  60000   10/8/2022

In [21]:
df.tail(2)

   empid   ename    sal         doj
4   1005  ashwin  80000  10/13/2022
5   1006  ganesh  95000   10/8/2022

In [22]:
df['ename']

0     mallinath
1       sathish
2    jeethendra
3       krishna
4        ashwin
5        ganesh
Name: ename, dtype: object

In [23]:
df[2:4]

   empid       ename    sal         doj
2   1003  jeethendra  70000  10/11/2022
3   1004     krishna  80000  10/12/2022

In [26]:
df[::2]

   empid       ename    sal         doj
0   1001   mallinath  50000  10/10/2022
2   1003  jeethendra  70000  10/11/2022
4   1005      ashwin  80000  10/13/2022

In [27]:
df[::-1]

   empid       ename    sal         doj
5   1006      ganesh  95000   10/8/2022
4   1005      ashwin  80000  10/13/2022
3   1004     krishna  80000  10/12/2022
2   1003  jeethendra  70000  10/11/2022
1   1002     sathish  60000   10/8/2022
0   1001   mallinath  50000  10/10/2022

In [28]:
df['ename']

0     mallinath
1       sathish
2    jeethendra
3       krishna
4        ashwin
5        ganesh
Name: ename, dtype: object

In [29]:
df.columns

Index(['empid', 'ename', 'sal', 'doj'], dtype='object')

In [30]:
df.ename

0     mallinath
1       sathish
2    jeethendra
3       krishna
4        ashwin
5        ganesh
Name: ename, dtype: object

In [31]:
df['empid']

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
Name: empid, dtype: int64

In [32]:
df[['ename','empid']]

        ename  empid
0   mallinath   1001
1     sathish   1002
2  jeethendra   1003
3     krishna   1004
4      ashwin   1005
5      ganesh   1006

In [34]:
df[['ename','sal']]

        ename    sal
0   mallinath  50000
1     sathish  60000
2  jeethendra  70000
3     krishna  80000
4      ashwin  80000
5      ganesh  95000

In [36]:
df['sal'].min()

50000

In [38]:
df.describe()

             empid           sal
count     6.000000      6.000000
mean   1003.500000  72500.000000
std       1.870829  16046.806536
min    1001.000000  50000.000000
25%    1002.250000  62500.000000
50%    1003.500000  75000.000000
75%    1004.750000  80000.000000
max    1006.000000  95000.000000

In [41]:
df[df.sal>50000]

   empid       ename    sal         doj
1   1002     sathish  60000   10/8/2022
2   1003  jeethendra  70000  10/11/2022
3   1004     krishna  80000  10/12/2022
4   1005      ashwin  80000  10/13/2022
5   1006      ganesh  95000   10/8/2022

In [42]:
df[df.sal ==df.sal.max()]

   empid   ename    sal        doj
5   1006  ganesh  95000  10/8/2022

In [43]:
df[df.sal ==df.sal.min()]

   empid      ename    sal         doj
0   1001  mallinath  50000  10/10/2022

In [44]:
df[df.sal < df.sal.mean()]

   empid       ename    sal         doj
0   1001   mallinath  50000  10/10/2022
1   1002     sathish  60000   10/8/2022
2   1003  jeethendra  70000  10/11/2022

In [45]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [47]:
df1=df.set_index('empid')

In [48]:
df1

            ename    sal         doj
empid
1001    mallinath  50000  10/10/2022
1002      sathish  60000   10/8/2022
1003   jeethendra  70000  10/11/2022
1004      krishna  80000  10/12/2022
1005       ashwin  80000  10/13/2022
1006       ganesh  95000   10/8/2022

In [49]:
df1.loc[1004]

ename       krishna
sal           80000
doj      10/12/2022
Name: 1004, dtype: object

In [50]:
df.set_index('empid',inplace=True)

In [51]:
df

            ename    sal         doj
empid
1001    mallinath  50000  10/10/2022
1002      sathish  60000   10/8/2022
1003   jeethendra  70000  10/11/2022
1004      krishna  80000  10/12/2022
1005       ashwin  80000  10/13/2022
1006       ganesh  95000   10/8/2022

In [53]:
df.reset_index(inplace=True)

In [56]:
df

   empid       ename    sal         doj
0   1001   mallinath  50000  10/10/2022
1   1002     sathish  60000   10/8/2022
2   1003  jeethendra  70000  10/11/2022
3   1004     krishna  80000  10/12/2022
4   1005      ashwin  80000  10/13/2022
5   1006      ganesh  95000   10/8/2022

In [57]:
df=pd.read_csv("D:\pandas\emp.csv")
df

   empid      ename      sal         doj
0   1001  mallinath  50000.0  10/10/2022
1   1002    sathish  60000.0   10/8/2022
2   1003        NaN  70000.0  10/11/2022
3   1004    krishna  80000.0  10/12/2022
4   1005     ashwin      NaN         NaN
5   1006     ganesh  95000.0   10/8/2022

In [59]:
df1=df.fillna(0)
df1

   empid      ename      sal         doj
0   1001  mallinath  50000.0  10/10/2022
1   1002    sathish  60000.0   10/8/2022
2   1003          0  70000.0  10/11/2022
3   1004    krishna  80000.0  10/12/2022
4   1005     ashwin      0.0           0
5   1006     ganesh  95000.0   10/8/2022

In [61]:
df1=df.fillna({'ename':'no_name','sal':'0.00','doj':"00-00-0000"})
df1

   empid      ename      sal         doj
0   1001  mallinath  50000.0  10/10/2022
1   1002    sathish  60000.0   10/8/2022
2   1003    no_name  70000.0  10/11/2022
3   1004    krishna  80000.0  10/12/2022
4   1005     ashwin     0.00  00-00-0000
5   1006     ganesh  95000.0   10/8/2022

In [62]:
df

   empid      ename      sal         doj
0   1001  mallinath  50000.0  10/10/2022
1   1002    sathish  60000.0   10/8/2022
2   1003        NaN  70000.0  10/11/2022
3   1004    krishna  80000.0  10/12/2022
4   1005     ashwin      NaN         NaN
5   1006     ganesh  95000.0   10/8/2022

In [64]:
df1=df.dropna()
df1

   empid      ename      sal         doj
0   1001  mallinath  50000.0  10/10/2022
1   1002    sathish  60000.0   10/8/2022
3   1004    krishna  80000.0  10/12/2022
5   1006     ganesh  95000.0   10/8/2022

In [66]:
df=pd.read_csv("D:\pandas\emp.csv")
df

   empid      ename    sal         doj
0   1001  mallinath  50000  10/10/2022
1   1002    sathish  60000   10/8/2022
2   1003  jeetendra  70000  10/11/2022
3   1004    krishna  80000  10/12/2022
4   1005     ashwin  80001  10/12/2022
5   1006     ganesh  95000   10/8/2022

In [67]:
df=pd.read_csv("D:\pandas\emp.csv",parse_dates=['doj'])
df

   empid      ename    sal        doj
0   1001  mallinath  50000 2022-10-10
1   1002    sathish  60000 2022-10-08
2   1003  jeetendra  70000 2022-10-11
3   1004    krishna  80000 2022-10-12
4   1005     ashwin  80001 2022-10-12
5   1006     ganesh  95000 2022-10-08

In [71]:
df1=df.sort_values('doj',ascending=False)
df1

   empid      ename    sal        doj
3   1004    krishna  80000 2022-10-12
4   1005     ashwin  80001 2022-10-12
2   1003  jeetendra  70000 2022-10-11
0   1001  mallinath  50000 2022-10-10
1   1002    sathish  60000 2022-10-08
5   1006     ganesh  95000 2022-10-08

In [72]:
df

   empid      ename    sal        doj
0   1001  mallinath  50000 2022-10-10
1   1002    sathish  60000 2022-10-08
2   1003  jeetendra  70000 2022-10-11
3   1004    krishna  80000 2022-10-12
4   1005     ashwin  80001 2022-10-12
5   1006     ganesh  95000 2022-10-08

In [77]:
df.loc[:,['ename','sal']]

       ename    sal
0  mallinath  50000
1    sathish  60000
2  jeetendra  70000
3    krishna  80000
4     ashwin  80001
5     ganesh  95000

In [78]:
df.iloc[:,[1,2]]

       ename    sal
0  mallinath  50000
1    sathish  60000
2  jeetendra  70000
3    krishna  80000
4     ashwin  80001
5     ganesh  95000

In [80]:
df.iloc[:,[1,2,3]]

       ename    sal        doj
0  mallinath  50000 2022-10-10
1    sathish  60000 2022-10-08
2  jeetendra  70000 2022-10-11
3    krishna  80000 2022-10-12
4     ashwin  80001 2022-10-12
5     ganesh  95000 2022-10-08

In [81]:
df.loc[0:3,['ename','sal']]

       ename    sal
0  mallinath  50000
1    sathish  60000
2  jeetendra  70000
3    krishna  80000

In [83]:
df.iloc[0:3]

   empid      ename    sal        doj
0   1001  mallinath  50000 2022-10-10
1   1002    sathish  60000 2022-10-08
2   1003  jeetendra  70000 2022-10-11

In [88]:
df.iloc[3:0:-1]

   empid      ename    sal        doj
3   1004    krishna  80000 2022-10-12
2   1003  jeetendra  70000 2022-10-11
1   1002    sathish  60000 2022-10-08

In [91]:
df.shape

(6, 4)

In [92]:
df[2:4]

   empid      ename    sal        doj
2   1003  jeetendra  70000 2022-10-11
3   1004    krishna  80000 2022-10-12

In [93]:
df.columns

Index(['empid', 'ename', 'sal', 'doj'], dtype='object')

In [94]:
df[['empid', 'ename', 'sal', 'doj']]

   empid      ename    sal        doj
0   1001  mallinath  50000 2022-10-10
1   1002    sathish  60000 2022-10-08
2   1003  jeetendra  70000 2022-10-11
3   1004    krishna  80000 2022-10-12
4   1005     ashwin  80001 2022-10-12
5   1006     ganesh  95000 2022-10-08

In [95]:
df.ename

0    mallinath
1      sathish
2    jeetendra
3      krishna
4       ashwin
5       ganesh
Name: ename, dtype: object

In [96]:
df[['ename','sal']]

       ename    sal
0  mallinath  50000
1    sathish  60000
2  jeetendra  70000
3    krishna  80000
4     ashwin  80001
5     ganesh  95000

In [98]:
df[df.sal.max()]

KeyError: 95000

In [99]:
df['sal'].max()

95000

In [100]:
df.sal.max()

95000

In [103]:
df[df.sal>df.sal.max()]

Empty DataFrame
Columns: [empid, ename, sal, doj]
Index: []

In [106]:
df[df.sal == df.sal.max()]

   empid   ename    sal        doj
5   1006  ganesh  95000 2022-10-08

In [109]:
df[df.sal == df.sal.max()]

   empid   ename    sal        doj
5   1006  ganesh  95000 2022-10-08

In [110]:
df

   empid      ename    sal        doj
0   1001  mallinath  50000 2022-10-10
1   1002    sathish  60000 2022-10-08
2   1003  jeetendra  70000 2022-10-11
3   1004    krishna  80000 2022-10-12
4   1005     ashwin  80001 2022-10-12
5   1006     ganesh  95000 2022-10-08

In [111]:
df

   empid      ename    sal        doj
0   1001  mallinath  50000 2022-10-10
1   1002    sathish  60000 2022-10-08
2   1003  jeetendra  70000 2022-10-11
3   1004    krishna  80000 2022-10-12
4   1005     ashwin  80001 2022-10-12
5   1006     ganesh  95000 2022-10-08

In [113]:
df[df.sal>60000]

   empid      ename    sal        doj
2   1003  jeetendra  70000 2022-10-11
3   1004    krishna  80000 2022-10-12
4   1005     ashwin  80001 2022-10-12
5   1006     ganesh  95000 2022-10-08

In [115]:
df[df.sal !=50000]

   empid      ename    sal        doj
1   1002    sathish  60000 2022-10-08
2   1003  jeetendra  70000 2022-10-11
3   1004    krishna  80000 2022-10-12
4   1005     ashwin  80001 2022-10-12
5   1006     ganesh  95000 2022-10-08

In [116]:
df.sal ==50000

0     True
1    False
2    False
3    False
4    False
5    False
Name: sal, dtype: bool

In [121]:
df[df.ename=='sathish'][['ename','ename']]

     ename    ename
1  sathish  sathish

In [123]:
df

   empid      ename    sal        doj
0   1001  mallinath  50000 2022-10-10
1   1002    sathish  60000 2022-10-08
2   1003  jeetendra  70000 2022-10-11
3   1004    krishna  80000 2022-10-12
4   1005     ashwin  80001 2022-10-12
5   1006     ganesh  95000 2022-10-08

In [125]:
df1=df.set_index('empid')

In [126]:
df1

           ename    sal        doj
empid
1001   mallinath  50000 2022-10-10
1002     sathish  60000 2022-10-08
1003   jeetendra  70000 2022-10-11
1004     krishna  80000 2022-10-12
1005      ashwin  80001 2022-10-12
1006      ganesh  95000 2022-10-08

In [128]:
df1.loc[1004]

ename                krishna
sal                    80000
doj      2022-10-12 00:00:00
Name: 1004, dtype: object